# coding=utf-8

from __future__ import unicode_literals
from .. import Provider as LoremProvider


class Provider(LoremProvider):
    word_list = (
        'أ', 'ال', 'السلام', 'عليكم', 'و', 'تجريبية', 'نصوص',
        'البركة', 'معلومات', 'لإنشاء', 'تجريبي', 'نص', 'هذا',
        'تجريبية', 'لتجربة', 'النصوص', 'الـ', 'عربية', 'في', 'البرامج',
        'والبرمجيات', 'العربية', 'التي', 'تحتاج', 'نصوص',
        'معرّبة', 'لإتمام', 'العمليات', 'البرمجّية', 'هنا', 'وهناك',
        'ولهذه', 'لأسباب', 'العديدة', 'بدأت', 'في', 'كتابة',
        'هذة', 'الكلمات', 'العربّية', 'لكي', 'نتم', 'التجربة',
        'الإنترنت', 'السعادة', 'كلمتين', 'واحد', 'اثنان', 'ثلاثة', 'كلمة',
        'أربعة', 'خمسة', 'ستة', 'سبعة', 'ثمانية', 'تسعة', 'عشرة', 'احدى', 'عشر'
    )
